<?php

namespace Database\Seeders;

use App\Models\Rule;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class RuleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Define your sample rules
        $rules = [
            [
                'name' => 'Rule1',
                'description' => 'वसतिगृहामध्ये प्रवेश घेतल्यानंतर रॅगिंगचा प्रयत्न केल्यास शासकीय रॅगिंग कायद्यानुसार कारवाई केली जाईल. ',
                'status'=>'0'
            ],
            [
                'name' => 'Rule2',
                'description' => 'ग्रामीण भागातील विद्यार्थ्यांना प्रथम प्राधान्यानाने प्रवेसह दिला जाईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule3',
                'description' => 'वसतिगृहामध्ये एकदा घेतलेला प्रवेश २० दिवसानंतर रद्द केल्यास फक्त डिपॉझीटची रक्कम परत करण्यात येईल. फी परत मिळणार नाही. तसेच वसतिगृहामध्ये सलग १५ दिवस गैरहजर राहिल्यास वसतिगृह प्रवेश रद्द करण्यात येईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule4',
                'description' => 'वसतिगृहामध्ये बाहेरील मित्रांना किंवा नातेवाईकांना निवासासाठी आणण्यास परवानगी नाही, तसे आढळल्यास रु.५००/- दंड आकारण्यात येईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule5',
                'description' => 'विद्यार्थ्यांना घरी जायचे असल्यास रेक्टरची लेखी परवानगी घेणे आवश्यक आहे. विद्यार्थ्यांना वारंवार घरी जाण्यास परवानगी दिली जाणार नाही. विद्यार्थी घरी पोहोचल्यावर पालकांनी किंवा विद्यार्थ्याने रेक्टर सरांना संपर्क करून घरी सुखरूप पोहोचल्याचे कळविणे अनिवार्य राहील, तसेच प्रवासातील व सुट्टीच्या कालावधीतील जबाबदारी विद्यार्थ्यांची स्वतःची व त्यांच्या पालकांची राहील ',
                'status'=>'0'
            ],
            [
                'name' => 'Rule6',
                'description' => 'मुलाला भेटायला येणाऱ्या पालकांना त्यांच्या आधारकार्डशिवाय भेटण्यास परवानगी दिली जाणार नाही.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule7',
                'description' => 'प्रत्येक विद्यार्थ्याने रात्री ७-०० वा. पुर्वी वसतिगृहात आलेच पाहिजे, त्यानंतर महाविद्यालय परिसरातसुद्धा विद्यार्थ्याला बाहेर जाता येणार नाही. रात्री ७-३० वा. सर्व विद्यार्थ्यांची हजेरी घेतली जाईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule8',
                'description' => 'वसतिगृहात लॅपटॉप अथवा मोबाइलचा वापर फक्त शैक्षणिक कामांसाठी करणे आवश्यक आहे, गाणे अथवा सिनेमा बघता येणार नाही.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule9',
                'description' => 'लॅपटॉप किंवा मोबाईलचा गैरवापर करताना आढळल्यास किंवा त्यासंदर्भात वसतिगृहाच्या नियमांचे उल्लंघन करताना आढळल्यास सदर विद्यार्थ्यांचा वसतिगृह प्रवेश रद्द करण्यात येईल. संगणकावरील इंटरनेट पॉलिसी संदर्भातील नियमावली वाचावी. वसतिगृहात अन्य कोणतेही इलेक्ट्रॉनिक / इलेक्ट्रिकल उपकरण वापरास सक्त बंदी आहे. तसेच वसतिगृहात स्टोव्ह किंवा गॅस वापरण्यास सक्त मनाई आहे, असे आढळल्यास सदर विद्यार्थ्यांचा वसतिगृह प्रवेश रद्द करण्यात येईल. विद्यार्थ्यांना रात्री ९-०० वा. नंतर मोबाईलवर बोलण्यास सक्त मनाई राहील. रूममध्ये एखादा विद्यार्थी सतत फोनवर बोलत असेल व वसतिगृहातील नियमांचे उल्लंघन करत असेल तर आपले नुकसान होऊ नये म्हणून सोबतच्या विद्यार्थ्यांनी हा सर्व प्रकार वेळेतच रेक्टरच्या लक्षात आणून द्यावा व याबाबत रेक्टरकडे लेखी स्वरूपात तक्रार अर्ज देणे आवश्यक राहील.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule10',
                'description' => 'वसतिगृहातील बाथरूम अथवा चेम्बरमध्ये कचरा (प्लास्टिक /शॅम्पो  पाऊच इ.) अडकलेला आढळल्यास प्रत्येक विद्यार्थ्याला रु. ५००/- प्रमाणे दंड आकारण्यात येईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule11',
                'description' => 'सोलर वॉटर सिस्टिम द्वारे पहाटे ५.३० ते स. ८-०० वाजेपर्यंत गरम पाणी उपलब्ध राहील.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule12',
                'description' => 'विद्यार्थ्यांना  ज्या रूममध्ये प्रवेश दिला जाईल त्याच रूममध्ये राहावे, परस्पर रूम बदलू नये. वार्षिक परीक्षा संपल्यानंतर वसतिगृह सोडताना आपण राहत असलेल्या रूमचा ताबा त्या रूममध्ये असलेल्या कॉलेजच्या साहित्यासह चावी व कुलुपासह रेक्टरकडे द्यावा. आपल्या रूम परस्पर बंद करून जाऊ नये, असे केल्यास त्या रूमची कुलुपे तोडून रूम रिकाम्या केल्या जातील. त्या रूममध्ये असणाऱ्या सामानाची जबाबदारी प्रशासनावर असणार नाही.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule13',
                'description' => 'ज्या विद्यार्थ्याना पुढील वर्षी वसतिगृहात प्रवेश घ्यावयाचा नसेल त्यांना  डिपॉझीट रक्कम ०१ ऑगस्टनंतरच मिळेल. ०३ वर्षांनंतर डिपॉझीट परत मिळणार नाही.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule14',
                'description' => 'वसतिगृहातील विद्यार्थ्यांना महाविद्यालयामार्फत चालविल्या जाणाऱ्या मेसमधुन भोजन मिळेल. बाहेरील मेसमधून डबे, हॉटेलमधून खाद्यपदार्थ  अथवा घरचे डबे मागविता येणार नाही. मेस फी वार्षिक रु. २४,०००/- असेल. प्रवेश निश्चतीनंतर दर महिन्याच्या १ तारखेला मेस फी ईन्चार्जकडे जमा करावी. ०५ दिवस व त्यापेक्षा जास्त दिवस सुट्ट्या झाल्यास मेसचे खाडे धरण्यात येतील.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule15',
                'description' => 'वसतिगृहातील रूमव्यतिरिक्त उदा. पोर्च, टी. व्ही. रूममध्ये बसवलेले ट्यूब बार  काढल्यास सामुदायिक जबाबदारी म्हणून सर्व विद्यार्थ्यांच्या डिपॉझीट रकमेतून या सामानाची रक्कम वजा केली जाईल. तसेच केणत्याही नुकसाणीस सामुदायिकरीत्या वसतिगृहातील विद्यार्थ्यांना जबाबदार धरण्यात येईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule16',
                'description' => 'विद्यार्थ्यांच्या काही मागण्या, सूचना, तक्रारी असतील तर रेक्टर यांच्याशी चर्चा केल्यांनतरच कार्यालयीन कामकाजाच्या वेळेत कार्यालयात मा.प्राचार्यांना भेटावे.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule17',
                'description' => 'वसतिगृहात धुलीवंदन / रंगपंचमी निमित्त रंग खेळणे किंवा पाण्याचा अपव्यय करण्यास बंदी आहे, असे आढळल्यास प्रत्येकी रु. २०००/-  दंड आकारण्यात येईल, या नियमाकडे दुर्लक्ष करून वसतिगृह इमारत खराब करण्याचा प्रयत्न केल्यास सदर विद्यार्थ्यांचा वसतिगृह प्रवेश रद्द करण्यात येईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule18',
                'description' => 'दैनंदिन कामकाज सुरळीत चालण्यासाठी केलेले नियम परिस्थितीनुसार बदल करण्याचे अधिकार प्रशासन राखून ठेवीत आहे. वसतिगृह पिण्याच्या पाण्याचा गैरवापर करताना अथवा रूममध्ये पाणी, लाईट, फॅन, व विजेच्या स्विचचा अनावश्यक वापर/अपव्यय करताना आढळणाऱ्या विद्यार्थ्यास प्रथमतः रु. १००/- व त्यांनतर रु. ५००/- दंड आकारण्यात येईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule19',
                'description' => 'परीक्षा संपल्यानंतर ताबडतोब रूम खाली करून रेक्टरच्या ताब्यात द्यावी. वसतिगृह सोडताना क्लिअरन्स फॉर्म पूर्ण करणे आवश्यक आहे. ',
                'status'=>'0'
            ],
            [
                'name' => 'Rule20',
                'description' => 'विद्यार्थी वसतिगृहात टु व्हिलर/फोर व्हिलर वाहने वापरास सक्त मनाई आहे. आवश्यक असल्यास फक्त सायकल वापरास परवानगी दिली जाईल. वसतिगृहाच्या खोलीला परस्पर कुलूप लावून घरी गेल्यास रु. ५००/- दंड आकारण्यात येईल.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule21',
                'description' => 'वसतिगृहातील विद्यार्थ्यांच्या आरोग्याविषयी समस्या निर्माण झाल्यास प्रथमतः रेक्टरला कल्पना देण्यात यावी, याविषयी रेक्टरांनी/पालकांनी मालपाणी हॉस्पिटल (फोन नं. ०२४२५-२२७५८२) यांना संपर्क करावा.',
                'status'=>'0'
            ],
            [
                'name' => 'Rule22',
                'description' => 'वरील सर्व नियम आम्ही स्वतः वाचले असून समजावून घेतले आहेत. या सर्व नियमांचे पालन करणे आमच्यावर बंधनकारक आहे. सदरच्या नियमांचे उल्लंघन केल्यास दंडात्मक कारवाई केली जाईल. तसेच प्रसंगी विद्यार्थी वसतिगृह प्रवेश रद्द करण्यात येईल. वरील सर्व नियम व अटी आम्हांला मान्य आहे म्हणून आम्ही खाली सही करीत आहोत.',
                'status'=>'0'
            ],

        ];
        Rule::insert($rules);
    }
    }
